# Linear Regression Equation

In [2]:
import pandas as pd

Let's put in the general Linear Regression equation

$y = bx + a$

In [3]:
df = pd.DataFrame({'X':[43,21,25,42,57,59],'Y':[99,65,79,75,87,81]})

In [4]:
df

    X   Y
0  43  99
1  21  65
2  25  79
3  42  75
4  57  87
5  59  81

In [5]:
df['X'].sum()

247

In [6]:
df['Y'].sum()

486

In [7]:
df['XY'] = df['X']*df['Y']

## We set the full dataframe to get all the data for computation

In [8]:
df

    X   Y    XY
0  43  99  4257
1  21  65  1365
2  25  79  1975
3  42  75  3150
4  57  87  4959
5  59  81  4779

In [9]:
df['X_squared'] = df['X']*df['X']

In [10]:
df

    X   Y    XY  X_squared
0  43  99  4257       1849
1  21  65  1365        441
2  25  79  1975        625
3  42  75  3150       1764
4  57  87  4959       3249
5  59  81  4779       3481

In [12]:
df['Y_squared'] = df['Y']*df['Y']

In [13]:
df

    X   Y    XY  X_squared  Y_squared
0  43  99  4257       1849       9801
1  21  65  1365        441       4225
2  25  79  1975        625       6241
3  42  75  3150       1764       5625
4  57  87  4959       3249       7569
5  59  81  4779       3481       6561

## We first find b

In [14]:
df.sum()

X              247
Y              486
XY           20485
X_squared    11409
Y_squared    40022
dtype: int64

In [27]:
A = (df['Y'].sum() * df['X_squared'].sum()) - (df['X'].sum() * df['XY'].sum())

In [28]:
B = df.shape[0]*df['X_squared'].sum() -(df['X'].sum())**2

In [34]:
round(A/B,4)

65.141599999999997

## We then find a

In [35]:
C = df.shape[0]*df['XY'].sum() - df['X'].sum()*df['Y'].sum()

In [37]:
D = df.shape[0]*df['X_squared'].sum() - (df['X'].sum())**2

In [42]:
C/D

0.3852249832102082